Reports/ОтчетПоБольничнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ОтчетПоБольничнымЛистам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыУчетаВремениДляСредней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУчетаВремениДляСредней</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРабочимДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРабочимЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДням</Name>
					<Comment>По календарным дням сучетом праздников</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДнямСПраздниками</Name>
					<Comment>По календарным дням без вычета праздников</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОтчетПоБольничнымЛистам/Ext/ObjectModule.bsl
#Если Клиент Тогда

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетЗаСчетСоцстраха",				ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛ);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетЗаСчетОрганизации",				ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛОрганизации);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетБольничныйТравмаНаПроизводстве",	ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛТравмаНаПроизводстве);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("РасчетБольничныйОтпускПоБиР",			ПланыВидовРасчета.Начисления.ОплатаПоСреднемуБЛПоБеременностиИРодам);
	
	                 
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Отчет по больничным листам';uk='Звіт по лікарняним листам'");
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	ТекстЗапроса = "
	| ВЫБРАТЬ 	
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1										КАК Показатель1,	
	|	Больничный.Регистратор.ПричинаНетрудоспособности			КАК Причина,	
	|	Больничный.Сотрудник										КАК Сотрудник,		
	|	Больничный.Регистратор										КАК Регистратор,
	|	Больничный.Регистратор.СерияБольничногоЛиста				КАК Серия,
	|	Больничный.Регистратор.НомерБольничногоЛиста				КАК Номер,
	|	СУММА(Больничный.НормаДней)					 				КАК НормаДней,
	|	СУММА(Больничный.Результат)						 			КАК Результат,
	|	СУММА(Больничный.НормаДнейОрг)					 			КАК НормаДнейОрг,
	|	СУММА(Больничный.РезультатОрг)						 		КАК РезультатОрг,
	|	СУММА(Больничный.НормаДнейСоц)					 			КАК НормаДнейСоц,
	|	СУММА(Больничный.РезультатСоц)					 			КАК РезультатСоц
	|
	|{ВЫБРАТЬ 
	|	РаботникиОрганизацииСрезПоследних.Организация.* 	КАК Организация	
	| }
	|ИЗ 
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(КонецПериода(&ДатаНач,Месяц),{Организация=&Организация}) КАК РаботникиОрганизацииСрезПоследних
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|   	ВЫБРАТЬ
	|   		БольничныйЗаСчетОрганизации.Показатель1 							КАК Показатель1,	
	|			БольничныйЗаСчетОрганизации.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйЗаСчетОрганизации.Сотрудник								КАК Сотрудник,			
	|			БольничныйЗаСчетОрганизации.Организация								КАК Организация,		
	|			БольничныйЗаСчетОрганизации.Регистратор								КАК Регистратор,		
	|			ВЫБОР КОГДА БольничныйЗаСчетОрганизации.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйЗаСчетОрганизации.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйЗаСчетОрганизации.НормаДней
	|			КОНЕЦ																КАК НормаДней,
	|			БольничныйЗаСчетОрганизации.Результат								КАК Результат,
	|			ВЫБОР КОГДА БольничныйЗаСчетОрганизации.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйЗаСчетОрганизации.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйЗаСчетОрганизации.НормаДней
	|			КОНЕЦ																КАК НормаДнейОрг,
	|			БольничныйЗаСчетОрганизации.Результат								КАК РезультатОрг,
	|			0					КАК НормаДнейСоц,
	|			0					КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйЗаСчетОрганизации
	|
	|   	ГДЕ	БольничныйЗаСчетОрганизации.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетОрганизации.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетОрганизации.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетОрганизации.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетОрганизации.ВидРасчета = &РасчетЗаСчетОрганизации
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйЗаСчетСоцстраха.Показатель1 КАК Показатель1,	
	|			БольничныйЗаСчетСоцстраха.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйЗаСчетСоцстраха.Сотрудник							КАК Сотрудник,			
	|			БольничныйЗаСчетСоцстраха.Организация						КАК Организация,		
	|			БольничныйЗаСчетСоцстраха.Регистратор						КАК Регистратор,		
	|			ВЫБОР КОГДА БольничныйЗаСчетСоцстраха.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйЗаСчетСоцстраха.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйЗаСчетСоцстраха.НормаДней
	|			КОНЕЦ														КАК НормаДней,
	|			БольничныйЗаСчетСоцстраха.Результат							КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0				КАК РезультатОрг,
	|			ВЫБОР КОГДА БольничныйЗаСчетСоцстраха.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйЗаСчетСоцстраха.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйЗаСчетСоцстраха.НормаДней
	|			КОНЕЦ														КАК НормаДнейСоц,
	|			БольничныйЗаСчетСоцстраха.Результат							КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйЗаСчетСоцстраха
	|
	|   	ГДЕ	БольничныйЗаСчетСоцстраха.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетСоцстраха.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетСоцстраха.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйЗаСчетСоцстраха.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйЗаСчетСоцстраха.ВидРасчета = &РасчетЗаСчетСоцстраха
	// Больничный "Травма на производстве"
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйТравмаНаПроизводстве.Показатель1 КАК Показатель1,	
	|			БольничныйТравмаНаПроизводстве.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйТравмаНаПроизводстве.Сотрудник						КАК Сотрудник,		
	|			БольничныйТравмаНаПроизводстве.Организация						КАК Организация,		
	|			БольничныйТравмаНаПроизводстве.Регистратор						КАК Регистратор,		
	|			ВЫБОР КОГДА БольничныйТравмаНаПроизводстве.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйТравмаНаПроизводстве.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйТравмаНаПроизводстве.НормаДней
	|			КОНЕЦ															КАК НормаДней,
	|			БольничныйТравмаНаПроизводстве.Результат						КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0				КАК РезультатОрг,
	|			ВЫБОР КОГДА БольничныйТравмаНаПроизводстве.ВидУчетаВремениДляСредней = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремениДляСредней.ПоКалендарнымДнямСПраздниками)
	|			ТОГДА
	|				БольничныйТравмаНаПроизводстве.ОплаченоДнейЧасов
	|			ИНАЧЕ 
	|				БольничныйТравмаНаПроизводстве.НормаДней
	|			КОНЕЦ															КАК НормаДнейСоц,
	|			БольничныйТравмаНаПроизводстве.Результат						КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйТравмаНаПроизводстве
	|
	|   	ГДЕ	БольничныйТравмаНаПроизводстве.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйТравмаНаПроизводстве.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйТравмаНаПроизводстве.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйТравмаНаПроизводстве.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйТравмаНаПроизводстве.ВидРасчета = &РасчетБольничныйТравмаНаПроизводстве
	// Больничный "Отпуск по БиР"
	|		ОБЪЕДИНИТЬ ВСЕ
	|   	ВЫБРАТЬ
	|   		БольничныйОтпускПоБиР.Показатель1 КАК Показатель1,	
	|			БольничныйОтпускПоБиР.Регистратор.ПричинаНетрудоспособности	КАК Причина,	
	|			БольничныйОтпускПоБиР.Сотрудник							КАК Сотрудник,			
	|			БольничныйОтпускПоБиР.Организация						КАК Организация,		
	|			БольничныйОтпускПоБиР.Регистратор						КАК Регистратор,		
	|			БольничныйОтпускПоБиР.ОплаченоДнейЧасов					КАК НормаДней,
	|			БольничныйОтпускПоБиР.Результат							КАК Результат,
	|			0				КАК НормаДнейОрг,
	|			0				КАК РезультатОрг,
	|			БольничныйОтпускПоБиР.ОплаченоДнейЧасов					КАК НормаДнейСоц,
	|			БольничныйОтпускПоБиР.Результат							КАК РезультатСоц
	|   	ИЗ РегистрРасчета.Начисления КАК БольничныйОтпускПоБиР
	|
	|   	ГДЕ	БольничныйОтпускПоБиР.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйОтпускПоБиР.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйОтпускПоБиР.ПериодРегистрации >= НачалоПериода(&ДатаНач,Месяц)
	|		И	БольничныйОтпускПоБиР.ПериодРегистрации <= КонецПериода(&ДатаНач,Месяц)
	|   	И	БольничныйОтпускПоБиР.ВидРасчета = &РасчетБольничныйОтпускПоБиР
	//
	|
	|   ) КАК Больничный
	|	ПО	Больничный.Сотрудник = РаботникиОрганизацииСрезПоследних.Сотрудник 
	|   И	(Больничный.Организация = РаботникиОрганизацииСрезПоследних.Организация 
	|   ИЛИ	Больничный.Организация = РаботникиОрганизацииСрезПоследних.Организация.ГоловнаяОрганизация)//условие ИЛИ нужно будет убрать, если при проведении будет указана не головная организация а просто организация
	|
	|{ГДЕ
	|	РаботникиОрганизацииСрезПоследних.Организация.* 				КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,		
	|   Больничный.Показатель1 											КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.*				КАК Причина,		
	|	Больничный.Сотрудник.* 											КАК Сотрудник,                        	
	| 	Больничный.Регистратор.*										КАК Регистратор
	|}
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации,
	|	Больничный.Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности,
	|	Больничный.Сотрудник,
	|	Больничный.Регистратор	
	|
	|{УПОРЯДОЧИТЬ ПО
	|	РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1 КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.*					КАК Причина,
	|	Больничный.Сотрудник.*					КАК Сотрудник,	
	|	Больничный.Регистратор.*				КАК Регистратор	
	|}
	|
	|ИТОГИ 
	|	СУММА(НормаДней),
	|	СУММА(Результат),
	|	СУММА(НормаДнейОрг),
	|	СУММА(РезультатОрг),
	|	СУММА(НормаДнейСоц),
	|	СУММА(РезультатСоц)	
	|ПО ОБЩИЕ,	
	|	ПодразделениеОрганизации,
	|	Показатель1,
	|   Причина,
	|	Сотрудник,	
	|	Регистратор
	| 
	|
	|{ИТОГИ ПО	
	|	РаботникиОрганизацииСрезПоследних.Организация.* 				КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.*	КАК ПодразделениеОрганизации,
	|   Больничный.Показатель1 											КАК Показатель1,
	|	Больничный.Регистратор.ПричинаНетрудоспособности.* 				КАК Причина,
	|   Больничный.Сотрудник.*											КАК Сотрудник,                	
	|	Больничный.Регистратор.*										КАК Регистратор	
	|}
	|";
	
							  
	
	ПостроительОтчета.Текст = ТекстЗапроса;							  
							  
	СтруктураПредставлениеПолей.Вставить("ПодразделениеОрганизации", "Подразделение");
	СтруктураПредставлениеПолей.Вставить("Сотрудник", "Работник");
	СтруктураПредставлениеПолей.Вставить("Показатель1", НСтр("ru='Процент выплаты';uk='Відсоток виплати'"));
	СтруктураПредставлениеПолей.Вставить("Причина", НСтр("ru='Причина болезни';uk='Причина хвороби'"));	
	
	Если ОбщийОтчет.Показатели.Найти("Серия", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Серия", "Серия", истина, "");		
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("Номер", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Номер", "Номер", истина, "");		
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("НормаДней", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДней", НСтр("ru='Дней болезни';uk='Днів хвороби'"), истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("Результат", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("Результат", "Сумма", истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;			
	Если ОбщийОтчет.Показатели.Найти("НормаДнейОрг", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДнейОрг", НСтр("ru='Дни за счет предприятия';uk='Дні за рахунок підприємства'"), истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("РезультатОрг", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("РезультатОрг", НСтр("ru='Сумма за счет предприятия';uk='Сума за рахунок підприємства'"), истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;		
	Если ОбщийОтчет.Показатели.Найти("НормаДнейСоц", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("НормаДнейСоц", НСтр("ru='Дни за счет соцстраха';uk='Дні за рахунок соцстраху'"), истина, "ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
	Если ОбщийОтчет.Показатели.Найти("РезультатСоц", "Имя") = Неопределено Тогда
		ОбщийОтчет.ЗаполнитьПоказатели("РезультатСоц", НСтр("ru='Сумма за счет соцстраха';uk='Сума за рахунок соцстраху'"), истина, "ЧЦ=15; ЧДЦ=2");		
	КонецЕсли;		
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// группировки по умолчанию
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("Организация");
	//ПостроительОтчета.ИзмеренияСтроки.Добавить("ПодразделениеОрганизации");
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Организация");	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	
	// настройки отчета
	ОбщийОтчет.РаскрашиватьИзмерения = Истина;
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	//ОбщийОтчет.мРежимВводаПериода = 1; // Дата
	
КонецПроцедуры

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет=Неопределено) Экспорт
	
	// Если отчет, вызвавший порцедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

#КонецЕсли
